In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('hiring.csv')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
df['exp']=df.experience

In [6]:
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),exp
0,NaN,8.0,9,50000,NaN
1,NaN,8.0,6,45000,NaN
2,five,6.0,7,60000,five
3,two,10.0,10,65000,two
4,seven,9.0,6,70000,seven
5,three,7.0,10,62000,three
6,ten,NaN,7,72000,ten
7,eleven,7.0,8,80000,eleven

In [7]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py) ... done
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5586 sha256=0ddd894ac0bcafb841d60d5417222cd7ffe48ad28271ba1919b67611ed75db89
  Stored in directory: /Users/shanajames/Library/Caches/pip/wheels/cb/f3/5a/d88198fdeb46781ddd7e7f2653061af83e7adb2a076d8886d6
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

In [9]:
from word2number import w2n

In [11]:
w2n.word_to_num('sixty five')

65

In [22]:
df.exp.fillna('zero',inplace=True)

In [23]:
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),exp
0,NaN,8.0,9,50000,zero
1,NaN,8.0,6,45000,zero
2,five,6.0,7,60000,five
3,two,10.0,10,65000,two
4,seven,9.0,6,70000,seven
5,three,7.0,10,62000,three
6,ten,NaN,7,72000,ten
7,eleven,7.0,8,80000,eleven

In [30]:
df['exp'] = df['exp'].apply(w22n)

In [28]:
def w22n(x):
    return w2n.word_to_num(x)

In [29]:
w22n('five')

5

In [31]:
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),exp
0,NaN,8.0,9,50000,0
1,NaN,8.0,6,45000,0
2,five,6.0,7,60000,5
3,two,10.0,10,65000,2
4,seven,9.0,6,70000,7
5,three,7.0,10,62000,3
6,ten,NaN,7,72000,10
7,eleven,7.0,8,80000,11

In [40]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(),inplace=True)

In [41]:
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),exp
0,NaN,8.000000,9,50000,0
1,NaN,8.000000,6,45000,0
2,five,6.000000,7,60000,5
3,two,10.000000,10,65000,2
4,seven,9.000000,6,70000,7
5,three,7.000000,10,62000,3
6,ten,7.857143,7,72000,10
7,eleven,7.000000,8,80000,11

In [33]:
from sklearn import linear_model

In [34]:
model = linear_model.LinearRegression()

In [42]:
model.fit(df[['test_score(out of 10)','interview_score(out of 10)','exp']],df['salary($)'])

LinearRegression()

In [43]:
model.predict([[2,9,6]])

array([57801.7884606])

In [44]:
model.predict([[12,10,10]])

array([90438.68025262])